Repository: Octavian25/gym_guardian_membership
Catalog: lib/l10n/app_*.arb
Languages: id

source: Hello World!
id: Hallo Dunia!

source: Welcome
id: Selamat Datang

source: Attendance
id: Kehadiran

source: Booking
id: Reservasi

source: Now
id: Sekarang

# booking_info
source: Total Reservation Slots Left For Today
id: Total Slot Reservasi Tersisa Untuk Hari Ini

# nearest_event
source: Nearest Scheduled Event
id: Event Terdekat Yang Dijadwalkan

# nearest_event_empty_title
source: No Upcoming Events Scheduled
id: Belum Ada Event Terdekat Yang Dijadwalkan

# nearest_event_empty_subtitle
source: Please check for upcoming events in the Calendar menu
id: Silahkan periksa event terdekat pada menu Calendar

# booking_history
source: Recent Booking History
id: Riwayat Reservasi Terbaru

# booking_history_empty_title
source: No Booking History Yet
id: Belum Ada Riwayat Reservasi

# booking_history_empty_subtitle
source: You haven't checked in yet. Booking history will appear after you make a reservation in the reservation banner above
id: Kamu belum absen. Riwayat reservasi akan muncul setelah kamu melakukan reservasi di banner reservasi atas

source: Attendance History
id: Riwayat Kehadiran

# attendance_history_subtitle
source: We are only showing the last 3 history
id: Kita hanya menampilkan 3 riwayat terakhir

# attendance_history_empty_title
source: No Attendance History Yet
id: Belum Ada Riwayat Kehadiran

# attendance_history_empty_subtitle
source: You haven't checked in yet. Attendance history will appear after you check-in.
id: Kamu belum absen. Riwayat kehadiran akan muncul setelah kamu check-in.

# attendance_history_show_all
source: Show All Attendance History
id: Lihat Semua Riwayat Kehadiran

# body_measure_tracker
source: Body Measurement Tracker
id: Pelacak Pengurukan Tubuh

source: Last BMI Value
id: Nilai BMI Terakhir

source: Update Measurement
id: Update Pengukuran

source: All Attendance History
id: Semua Riwayat Kehadiran

source: No more data
id: Tidak ada lagi data

source: Current Level
id: Level Saat Ini

source: Exchange Point
id: Tukar Poin

# poin_history
source: Point History
id: Riwayat Poin

source: Description
id: Deskripsi

source: Starting Point
id: Poin Awal

source: Entry Point
id: Poin Masuk

source: Exit Point
id: Poin Keluar

source: Final Point
id: Poin Akhir

source: Forgot Password
id: Lupa Kata Sandi

# forgot_password_subtitle
source: Enter your email below to receive password reset code.
id: Masukkan email Anda di bawah sini untuk menerima kode pengaturan ulang kata sandi.

source: Gym Schedule
id: Jadwal Kegiatan Gym

# gym_schedule_subtitle
source: Check out all our Gym Activities
id: Periksa semua kegiatan Gym Kami

# no_event_today
source: No Activities Today...
id: Tidak Ada Kegiatan Hari Ini...

source: Scheduled
id: Terjadwal

source: Until
id: Sampai

# max_quota
source: Maximum Quota
id: Kuota Maksimal

source: Available Quota
id: Kuota Tersedia

source: Reservation
id: Reservasi

# cant_get_data_from_sistem
source: Failed to retrieve member data from the system
id: Gagal mengambil data member dari sistem

# booking_event_confirm_title
source: Are You Sure?
id: Apakah Kamu Yakin ?

# booking_event_confirm_subtitle
source: You are about to book this activity, but don't worry if you change your mind, you can cancel up to h-1
id: Kamu akan Reservasi Kegiatan ini, tapi jangan khawatir jika kamu ingin berubah pikiran, kamu bisa cancel sampai h-1

# your_account_not_active_title
source: Your Account is Not Active Yet
id: Akun Anda Belum Aktif

# your_account_not_active_subtitle
source: Please contact the admin to activate your account and don't forget to pay the subscription fee.
id: Silakan hubungi admin untuk aktivasi akun dan jangan lupa untuk membayar biaya berlangganan.

source: Service
id: Layanan

# reservation_service_subtitle
source: This is just an estimation, it's okay if it takes longer.
id: Ini hanya estimasi, tidak apa-apa jika waktunya lebih lama.

source: Date
id: Tanggal

# click_calendar_icon
source: Click the calendar icon to select a date
id: Klik ikon kalender untuk memilih tanggal

# reservation_only_today
source: Sorry, reservations are only available for today. Thank you for your understanding!
id: Maaf, pemesanan hanya tersedia untuk hari ini ya. Terima kasih atas pengertiannya!

# reservation_success_title
source: Yay, Booking Successful!
id: Yeay, Pemesanan Berhasil!

# reservation_success_subtitle
source: Your reservation is set! See you soon and enjoy our services!
id: Reservasi Anda sudah siap! Sampai jumpa dan selamat menikmati layanan kami!

# reservation_now
source: RESERVE NOW!
id: RESERVASI SEKARANG!

# checkout_confirmation_title
source: Ready to Check Out?
id: Mau Check Out

# checkout_confirmation_subtitle
source: Session will end, points and attendance updated. Okay?
id: Sesi akan berakhir, poin dan kehadiran diperbarui. Oke?

# checkout_confirmation_negative
source: Stay Here
id: Tetap di Sini

# beacon_scan_title
source: Approach Check-in Point
id: Dekati Titik Pengecekan

# beacon_scan_subtitle
source: Make sure you are near the check-in point location for your attendance to be recorded.
id: Pastikan Anda berada di dekat lokasi titik pengecekan agar kehadiran Anda tercatat.

# beacon_distance
source: Distance to Check-in Point Location
id: Jarak ke Lokasi Titik Pengecekan

# booking_failed_title
source: Booking Failed
id: Tidak Bisa Booking

# booking_failed_subtitle
source: You are currently on location. Please check out first to book a slot.
id: Anda sedang berada di lokasi. Check out dulu ya untuk Booking slot.

source: Congrats
id: Selamat

# checkout_message
source: Keep practicing to reach the next level
id: Teruslah berlatih untuk mencapai level berikutnya

# point_earned
source: Points Earned
id: Poin yang Didapatkan

source: Info
id: Informasi

# detail_attendance_popup
source: Your attendance details: Check In, Check Out, and points you earned!
id: Detail kehadiranmu: Check In, Check Out, dan poin yang kamu dapat!

# detail_booking_subtitle
source: Estimated time, can be canceled!
id: Perkiraan waktu, boleh dibatalkan lho!

# cancel_booking_title
source: Really Want to Cancel?
id: Beneran Mau Batalin

# cancel_booking_subtitle
source: It's okay if you change your mind. Cancellation will remove it from your schedule.
id: Gak papa kok kalau berubah pikiran. Pembatalan akan menghapusnya dari jadwalmu.

# cancel_booking_negative
source: No, Continue!
id: Gak Jadi, Lanjut!

# cancel_booking_positive
source: Cancel Anyway
id: Batalkan Aja

source: Cancel
id: Batalkan

# chose_notification_time_show_up_title
source: Please Select Notification Time to Show Up
id: Silahkan Pilih Waktu Notifikasi Muncul

# chose_notification_time_show_up_subtitle
source: For example, if you want 30 Minutes Before Start
id: Misalkan ingin 30 Menit Sebelum Dimulai

source: Select
id: Pilih

source: Almost Started
id: Hampir Dimulai

# lets_get_ready
source: Get ready! Event will start in
id: Ayo bersiap! Event akan dimulai dalam

# logout_other_device_title
source: You are already logged in on another device
id: Anda sudah masuk di perangkat lain

# logout_other_device_subtitle
source: Do you want to log out from the other device and log in from this device?
id: Apakah Anda ingin keluar dari perangkat lain dan masuk dari perangkat ini?

source: Welcome Back
id: Selamat Datang Kembali

# please_login
source: Please log in to continue to the application
id: Silahkan login untuk lanjut kedalam aplikasi

# email
source: Email Address
id: Alamat Email

source: Password
id: Kata Sandi

source: Enter
id: Masuk

# dont_have_account
source: Don't have an account
id: Belum punya akun

source: Sign Up
id: Daftar

# preview_registration_data_title
source: Double Check Your Data
id: Periksa Kembali Data Anda

# preview_registration_data_subtitle
source: Please double-check your data, if it's correct, please press register
id: Silahkan periksa kembali data anda, jika sudah benar silahkan tekan daftar

source: Full Name
id: Nama Lengkap

source: Phone Number
id: Nomor Telepon

source: Gender
id: Jenis Kelamin

source: Age
id: Umur

source: Height
id: Tinggi

source: Weight
id: Berat

source: Goals
id: Tujuan

source: Activity Level
id: Tingkat Aktivitas

source: Workout Preference
id: Latihan Yang Dimau

source: Workout Duration
id: Durasi Latihan

source: Workout At
id: Latihan Di Mana

source: Special Condition
id: Kondisi Khusus

source: Condition
id: Kondisi

source: Motivation
id: motifasi

source: Selected Plan
id: Paket Dipilih

source: Duration
id: Durasi

# im_agree_with
source: I agree with the
id: Saya setuju dengan

# term_and_condition
source: terms and conditions
id: syarat dan ketentuan yang berlaku

# pricing_plan_title
source: Subscription Plan
id: Paket Berlangganan

# pricing_plan_subtitle
source: Please select the subscription plan you want
id: Silahkan pilih paket berlangganan yang anda inginkan

source: Day
id: Hari

source: Preview Account
id: Tinjau Akun

source: Reload
id: Muat Ulang

source: Profile
id: Profil

# subscription_info_title
source: Subscription Information
id: Informasi Berlangganan

# subscription_info_subtitle
source: Your Subscription Data Information
id: Informasi Data Berlangganan Anda

source: Plan Name
id: Nama Paket

source: Payment Status
id: Status Pembayaran

source: Paid
id: Dibayar

source: Not Paid
id: Belum Dibayar

# plan_expired
source: Expiry Date
id: Tanggal Berakhir

# allow_notification
source: Allow Notifications
id: Izinkan Notifikasi

source: Exit
id: Keluar

source: Version
id: Versi

# delete_account_title
source: We're sad to see you go!
id: Kami sedih melihat Anda pergi!

# delete_account_subtitle
source: If you delete your account, you will permanently lose all data, points, and rewards.
id: Jika Anda menghapus akun Anda, Anda akan kehilangan semua data, poin, dan hadiah secara permanen.

# delete_account_positive
source: Just Keep It!
id: Simpan Saja!

# delete_account_negative
source: Yes, Delete Account
id: Ya, Hapus Akun

source: Updated
id: Diperbarui

# update_profile_subtitle
source: Your profile details have been successfully updated. Press OK to log back in and continue using the application.
id: Detail profil Anda telah berhasil diperbarui. Tekan OK untuk masuk kembali dan melanjutkan penggunaan aplikasi.

source: Failed
id: Gagal

# update_profile_failed_subtitle
source: An error occurred while updating your profile. Please try again or contact support if the issue persists.
id: Terjadi kesalahan saat memperbarui profil Anda. Silakan coba lagi atau hubungi dukungan jika masalah terus berlanjut.

# cant_find_edit_data
source: If you cannot find the data you want to change, please contact customer service.
id: Jika Anda tidak dapat menemukan data yang ingin Anda ubah, silakan hubungi layanan pelanggan.

# request_delete_account
source: Request Account Deletion
id: Permintaan Hapus Akun

# logout_dialog_title
source: Ready to go
id: Siap untuk pergi

# logout_dialog_subtitle
source: Logging out will disconnect you from your account. Don't worry—you can always log back in!
id: Keluar akan memutuskan koneksi Anda dari akun Anda. Jangan khawatir-Anda dapat masuk kembali kapan saja!

# logout_dialog_positive
source: Yes, Logout
id: Ya, Keluar

# logout_dialog_negavite
source: Stay Here
id: Tatap Disini

# password_not_match
source: Passwords do not match
id: Password tidak sama

source: Sign Up New Member
id: Daftar Member Baru

# sign_up_new_member_subtitle
source: Please enter your personal data
id: Silahkan masukan data diri Anda

source: Personal Information
id: Informasi Pribadi

source: Public Information
id: Informasi Umum

# public_information_1
source: What Is Your Main Goal?
id: Apa Tujuan Utam Anda ?

# public_information_2
source: How active are you now?
id: Seberapa aktif Anda sekarang ?

# public_information_3
source: What type of workout do you like?
id: Jenis latihan apa yang Anda sukai?

# public_information_4
source: How much time do you have for workouts?
id: Berapa lama waktu yang Anda miliki untuk latihan?

# public_information_5
source: When do you prefer to exercise?
id: Kapan Anda lebih sering berolahraga?

# public_information_6
source: Do you have any special conditions that need attention?
id: Apakah anda memiliki kondisi khusus yang perlu diperhatikan?

# public_information_7
source: If yes, write down your special condition
id: Jika ada, tuliskan kondisi khusus Anda

# public_information_8
source: What is your biggest motivation for starting to exercise?
id: Apa motivasi terbesa Anda untuk memulai latihan?

source: Re-Password
id: Ulang kata sandi

source: Next
id: Lanjutkan

# already_have_account
source: Already have an account?
id: Sudah punya akun?

# you_already_in
source: You are already in
id: Anda Sudah di

# you_already_out
source: You are already out
id: Anda Sudah diluar

# auto_check_in_message
source: application detects that you have arrived at Nagatech Cilengkrang Office. Want to check-in automatically?
id: aplikasi mendeteksi Anda telah tiba di Kantor Nagatech Cilengkrang. Mau check-in otomatis?

# auto_check_in_negative
source: No
id: Tidak

# auto_check_in_positive
source: Yes
id: Ya

# auto_check_out_message
source: application detects that you have left Nagatech Cilengkrang Office without checking-out. Therefore you will not get point addition
id: aplikasi mendeteksi Anda telah diluar Kantor Nagatech Cilengkrang tanpa melakukan check-out. Untuk itu Anda tidak mendapatkan penambahan poin

# failed_fetch_member_title
source: Failed to Retrieve Member Details
id: Gagal Mengambil Detail Member

# failed_fetch_member_subtitle
source: There was a problem retrieving member data. Please check your internet connection and try again.
id: Terjadi masalah saat mengambil data member. Silakan periksa koneksi internet Anda dan coba lagi.

source: Reservation Service
id: Layanan Reservasi

source: Check Out Confirmation
id: Mau Check Out?

# checkin_info
source: Check-in Information
id: Informasi Kehadiran

# cancel_booking_dialogue_tilte
source: Booking Cancelled!
id: Booking Dibatalkan!

# cancel_booking_dialogue_subtitle
source: Your booking has been cancelled. See you again!
id: Booking kamu sudah dibatalkan. Sampai jumpa lagi!

# reservation_info
source: Booking Info
id: Info Booking

source: Cancel Booking
id: Batalkan Booking

# last_update_measurement
source: Last Measurement Update
id: Update Pengukuran Terakhir

source: Chest Circumference
id: Lingkar Dada

# hows_your_chest_circumference
source: What is your current Chest Circumference?
id: Berapa Lingkar Dada kamu saat ini?

source: Thigh Circumference
id: Lingkar Paha

# hows_your_thigh_circumference
source: What is your current Thigh Circumference?
id: Berapa Lingkar Paha kamu saat ini?

source: Waist Circumference
id: Lingkar Pinggang

# hows_your_waist_circumference
source: What is your current Waist Circumference?
id: Berapa Lingkar Pinggang kamu saat ini?

source: Arm Circumference
id: Lingkar Lengan

# hows_your_arm_circumference
source: What is your current Arm Circumference?
id: Berapa Lingkar Lengan kamu saat ini?

source: Body Fat
id: Kadar Lemak Tubuh

# hows_your_body_fat
source: What is your current Body Fat?
id: Berapa Kada Lemak Tubuh kamu saat ini?

source: Redeem Point
id: Tukar Poin

# detail_point_empty
source: Empty Point History
id: Riwayat Poin Kosong

# detail_point_empty_subtitle
source: Collect or use points to see your activity here.
id: Kumpulkan atau gunakan poin untuk melihat aktivitas Anda di sini.

# reservation_event_success
source: Yay! Booking Successful!
id: Yay! Booking Berhasil!

# reservation_event_success_subtitle
source: Your slot is secured! Thank you for booking, we are ready to welcome you. If you need more info, don't hesitate to contact us!
id: Slot Anda sudah aman! Terima kasih sudah booking, kami siap menyambut Anda. Jika butuh info lebih lanjut, jangan ragu untuk menghubungi kami!

# reservation_event_failed
source: Oops! Booking Failed
id: Oops! Booking Gagal

# reservation_event_failed_subtitle
source: There was a slight problem, but don't worry! Try checking your connection or repeating the process. If you need help, we are ready to assist!
id: Ada sedikit kendala, tapi jangan khawatir! Coba periksa koneksi atau ulangi prosesnya. Jika butuh bantuan, kami siap membantu!

source: Start
id: Mulai

source: Already Scheduled
id: Sudah Dijadwalkan

# scheduled_passed
source: Schedule Passed
id: Jadwal Sudah Terlewat

# your_not_select_plan
source: You have not selected a subscription plan
id: Anda belum memilih paket berlangganan

# your_skip_fill_data
source: You skipped filling in your personal data, please go back and fill in your personal data first
id: Anda melewatkan pengisian data diri, silahkan kembali dan isi data diri terlebih dahulu

# body_measurement_success
source: Body Measurement Data Successfully Saved!
id: Data Pengukuran Tubuh Berhasil Disimpan!

# body_measurement_success_subtitle
source: Your body measurement data has been saved successfully. Use this information to track your fitness progress and achieve more optimal targets! 💪✨
id: Data pengukuran tubuh kamu telah berhasil disimpan. Gunakan informasi ini untuk melacak progres kebugaranmu dan mencapai target yang lebih optimal! 💪✨

# body_measurement_failed
source: Failed to Save Body Measurement Data
id: Gagal Menyimpan Data Body Measurement

# body_measurement_failed_subtitle
source: An error occurred while saving body measurement data. Please try again or check your internet connection. If the problem persists, contact the support team.
id: Terjadi kesalahan saat menyimpan data pengukuran tubuh. Silakan coba lagi atau periksa koneksi internet kamu. Jika masalah berlanjut, hubungi tim support.

source: BODY MEASUREMENT
id: PENGUKURAN TUBUH

source: Finish
id: Selesai

# create_reminder
source: Turn on Reminder?
id: Nyalakan Pengingat?

# create_reminder_subtitle
source: Don't forget! Activate notifications so you always remember to measure your body progress on time.
id: Jangan sampai lupa! Aktifkan notifikasi agar kamu selalu ingat untuk mengukur progres tubuhmu tepat waktu.

source: Activate
id: Nyalakan

# interval_not_setted
source: Interval Not Selected!
id: Interval Belum Dipilih!

# interval_not_setted_subtitle
source: Want to be reminded every how many days? Select an interval so we can remind you according to your desired schedule.
id: Mau diingatkan setiap berapa hari? Pilih interval agar kami bisa mengingatkanmu sesuai jadwal yang kamu inginkan.

# notification_time_not_setted
source: Notification Time Not Selected!!
id: Waktu Notifikasi Belum Dipilih!!

# notification_time_not_setted_subtitle
source: Want to be reminded at what time? Choose the right time so the reminder comes at the most suitable time for you.
id: Ingin diingatkan jam berapa? Pilih waktu yang tepat agar pengingat datang di saat yang paling pas buatmu.

# notification_check_body_measurement
source: 📏 Time to Check Body Progress
id: 📏 Saatnya Cek Progress Tubuh

# notification_check_body_measurement_subtitle
source: Don't forget to measure and record your body progress today
id: Jangan lupa ukur dan catat perkembangan tubuhmu hari ini

# set_notification_success
source: Notification Successfully Set!
id: Notifikasi Berhasil Disetel!

# set_notification_success_subtitle
source: Reminder is active. We will remind you according to the schedule you choose. Keep the spirit up in recording your progress!
id: Pengingat sudah aktif. Kami akan mengingatkanmu sesuai jadwal yang kamu pilih. Tetap semangat mencatat progresmu!

# set_notification_failed
source: Oops! Failed to Set Notification
id: Oops! Gagal Menyetel Notifikasi

# set_notification_failed_subtitle
source: There was a problem saving the reminder. Try again or check notification permissions in your device settings.
id: Terjadi kendala saat menyimpan pengingat. Coba lagi atau periksa izin notifikasi di pengaturan perangkatmu.

source: Unnecessary
id: Tidak Perlu

# hows_your_height
source: What is your current Height?
id: Berapa Tinggi Badan kamu saat ini?

# hows_your_weight
source: What is your current Weight?
id: Berapa Berat Badan kamu saat ini?

source: Your BMI
id: BMI Kamu

source: Skinny
id: Kurus

# healty
source: Healthy
id: Sehat

source: Over Weight
id: Kelebihan Berat

source: Mild Obesity
id: Obesitas Ringan

source: Moderate Obesity
id: Obesirat Sedang

source: Morbid Obesity
id: Obesitas Berat

# delete_chat_jiva
source: Delete Chat History with JIVA?
id: Hapus Riwayat Chat dengan JIVA?

# delete_chat_jiva_subtitle
source: Are you sure you want to delete all conversations? This action cannot be undone, and all messages will be lost forever.
id: Yakin ingin menghapus semua percakapan? Tindakan ini tidak bisa dibatalkan, dan semua pesan akan hilang selamanya.

source: Quick Chat
id: Text Cepat

source: Write Your Task
id: Tuliskan Perintah

source: Next Set
id: Set Selanjutnya

# exercise_timer_subtitle
source: If you feel tired, take a break immediately and do not force your body
id: Jika anda merasa lelah, segera istirahat dan jangan paksakan tubuh anda

source: Repetition
id: Repetisi

# exercise_finish_title
source: Great!
id: Mantap!

# your_finish_exercise
source: You have completed the exercise
id: Kamu sudah menyelesaikan latihan

source: Amazing
id: Luar biasa

# break_dialog_title
source: Take a Break
id: Santai Dulu

# break_dialog_subtitle
source: Take a breath, relax, and get ready for the next set!
id: Tarik napas, rileks, dan siap untuk set berikutnya!

source: Language
id: Bahasa

source: Edit Profile
id: Ubah Profile

# change_language_dialog
source: Change Languange Successfully
id: Ubah Bahasa Berhasil

source: Tools Used
id: Alat yang digunakan

source: Detail Information
id: Detail Informasi

source: Estimated Duration
id: Perkiraan Durasi

# duration_per_repetition
source: Duration Per Repetisi
id: Waktu Per Repetisi

# rest_per_set
source: Break Per Set
id: Istirahat Antar Set

source: Benefits
id: Manfaat

source: How To Do It
id: Bagaimana cara melakukannya

source: See All
id: Lihat Semua

# show_video_tutorial
source: Show Tutorial Video
id: Lihat Video Tutorial

source: Start Workout
id: Mulai Workout

source: Show Less
id: Lebih Sedikit

# workout_recommendation
source: Make Workout Recommendations
id: Buatkan Rekomendasi Workout

source: Workout Challenge
id: Tantangan Workout

# preparing_videos
source: Preparing Video..
id: Menyiapkan Video..

# got_problem_videos
source: We Got Some Problem when playing videos
id: Ada Kendala Saat Meminta Video Referensi

source: Reload Video
id: Muat Ulang Video

# how_to_use_video
source: How To Use It
id: Tutorial Cara Menggunakan Alat

# how_to_use_video_note
source: **If you are unsure, please ask your Personal Trainer or the management staff on how to use it.
id: **Jika kamu ragu, silahkan bertanya kepada Personal Trainer atau staff pengelola tentang cara penggunaannya

source: Close
id: Tutup
